schreibfaul1/ESP32-audioI2S/src/Audio.h
    AudioBuffer InBuff; // instance of input buffer

public:
    Audio(bool internalDAC = false, uint8_t channelEnabled = 3, uint8_t i2sPort = I2S_NUM_0); // #99
    ~Audio();
    void setBufsize(int rambuf_sz, int psrambuf_sz);
    bool openai_speech(const String& api_key, const String& model, const String& input, const String& voice, const String& response_format, const String& speed);
    bool connecttohost(const char* host, const char* user = "", const char* pwd = "");
    bool connecttospeech(const char* speech, const char* lang);
    bool connecttoFS(fs::FS &fs, const char* path, int32_t m_fileStartPos = -1);
    bool setFileLoop(bool input);//TEST loop
    void setConnectionTimeout(uint16_t timeout_ms, uint16_t timeout_ms_ssl);
    bool setAudioPlayPosition(uint16_t sec);
    bool setFilePos(uint32_t pos);
    bool audioFileSeek(const float speed);
    bool setTimeOffset(int sec);
    bool setPinout(uint8_t BCLK, uint8_t LRC, uint8_t DOUT, int8_t MCLK = I2S_GPIO_UNUSED);
    bool pauseResume();
    bool isRunning() {return m_f_running;}
    void loop();
    uint32_t stopSong();
    void forceMono(bool m);
    void setBalance(int8_t bal = 0);
    void setVolumeSteps(uint8_t steps);
    void setVolume(uint8_t vol, uint8_t curve = 0);
    uint8_t getVolume();
    uint8_t maxVolume();
    uint8_t getI2sPort();

    uint32_t getAudioDataStartPos();
    uint32_t getFileSize();
    uint32_t getFilePos();
    uint32_t getSampleRate();
    uint8_t  getBitsPerSample();
    uint8_t  getChannels();
    uint32_t getBitRate(bool avg = false);
    uint32_t getAudioFileDuration();
    uint32_t getAudioCurrentTime();
    uint32_t getTotalPlayingTime();
    uint16_t getVUlevel();

    uint32_t inBufferFilled(); // returns the number of stored bytes in the inputbuffer
    uint32_t inBufferFree();   // returns the number of free bytes in the inputbuffer
    uint32_t inBufferSize();   // returns the size of the inputbuffer in bytes
    void setTone(int8_t gainLowPass, int8_t gainBandPass, int8_t gainHighPass);
    void setI2SCommFMT_LSB(bool commFMT);
    int getCodec() {return m_codec;}
    const char *getCodecname() {return codecname[m_codec];}
    void unicode2utf8(char* buff, uint32_t len);

private:

    #ifndef ESP_ARDUINO_VERSION_VAL
        #define ESP_ARDUINO_VERSION_MAJOR 0
        #define ESP_ARDUINO_VERSION_MINOR 0
        #define ESP_ARDUINO_VERSION_PATCH 0
    #endif

  enum : int8_t { AUDIOLOG_PATH_IS_NULL = -1, AUDIOLOG_FILE_NOT_FOUND = -2, AUDIOLOG_OUT_OF_MEMORY = -3, AUDIOLOG_FILE_READ_ERR = -4, AUDIOLOG_ERR_UNKNOWN = -127 };

  void            UTF8toASCII(char* str);
  bool            latinToUTF8(char* buff, size_t bufflen);
  void            setDefaults(); // free buffers and set defaults
  void            initInBuff();
  bool            httpPrint(const char* host);
  void            processLocalFile();
  void            processWebStream();
  void            processWebFile();
  void            processWebStreamTS();
  void            processWebStreamHLS();
  void            playAudioData();
  bool            readPlayListData();
  const char*     parsePlaylist_M3U();
  const char*     parsePlaylist_PLS();
  const char*     parsePlaylist_ASX();
  const char*     parsePlaylist_M3U8();
  const char*     m3u8redirection();
  uint64_t        m3u8_findMediaSeqInURL();
  bool            STfromEXTINF(char* str);
  void            showCodecParams();
  int             findNextSync(uint8_t* data, size_t len);
  int             sendBytes(uint8_t* data, size_t len);
  void            setDecoderItems();
  void            computeAudioTime(uint16_t bytesDecoderIn, uint16_t bytesDecoderOut);
  void            printProcessLog(int r, const char* s = "");
  void            printDecodeError(int r);
  void            showID3Tag(const char* tag, const char* val);
  size_t          readAudioHeader(uint32_t bytes);
  int             read_WAV_Header(uint8_t* data, size_t len);
  int             read_FLAC_Header(uint8_t* data, size_t len);
  int             read_ID3_Header(uint8_t* data, size_t len);
  int             read_M4A_Header(uint8_t* data, size_t len);
  size_t          process_m3u8_ID3_Header(uint8_t* packet);
  bool            setSampleRate(uint32_t hz);
  bool            setBitsPerSample(int bits);
  bool            setChannels(int channels);
  bool            setBitrate(int br);
  void            playChunk();
  bool            playSample(int16_t sample[2]);
  void            computeVUlevel(int16_t sample[2]);
  void            computeLimit();
  int32_t         Gain(int16_t s[2]);
  void            showstreamtitle(const char* ml);
  bool            parseContentType(char* ct);
  bool            parseHttpResponseHeader();
  bool            initializeDecoder();
  esp_err_t       I2Sstart(uint8_t i2s_num);
  esp_err_t       I2Sstop(uint8_t i2s_num);
  void            urlencode(char* buff, uint16_t buffLen, bool spacesOnly = false);
  int16_t*        IIR_filterChain0(int16_t iir_in[2], bool clear = false);
  int16_t*        IIR_filterChain1(int16_t iir_in[2], bool clear = false);
  int16_t*        IIR_filterChain2(int16_t iir_in[2], bool clear = false);
  inline void     setDatamode(uint8_t dm) { m_datamode = dm; }
  inline uint8_t  getDatamode() { return m_datamode; }
  inline uint32_t streamavail() { return _client ? _client->available() : 0; }
  void            IIR_calculateCoefficients(int8_t G1, int8_t G2, int8_t G3);
  bool            ts_parsePacket(uint8_t* packet, uint8_t* packetStart, uint8_t* packetLength);

  //+++ W E B S T R E A M  -  H E L P   F U N C T I O N S +++
  uint16_t readMetadata(uint16_t b, bool first = false);
  size_t   chunkedDataTransfer(uint8_t* bytes);
  bool     readID3V1Tag();
  boolean  streamDetection(uint32_t bytesAvail);
  void     seek_m4a_stsz();
  void     seek_m4a_ilst();
  uint32_t m4a_correctResumeFilePos(uint32_t resumeFilePos);
  uint32_t ogg_correctResumeFilePos(uint32_t resumeFilePos);
  int32_t  flac_correctResumeFilePos(uint32_t resumeFilePos);
  int32_t  mp3_correctResumeFilePos(uint32_t resumeFilePos);
  uint8_t  determineOggCodec(uint8_t* data, uint16_t len);

  //++++ implement several function with respect to the index of string ++++
  void strlower(char* str) {
      unsigned char* p = (unsigned char*)str;
      while(*p) {
          *p = tolower((unsigned char)*p);
          p++;
      }
    }


    void trim(char *s) {
    //fb   trim in place
        char *pe;
        char *p = s;
        while ( isspace(*p) ) p++; //left
        pe = p; //right
        while ( *pe != '\0' ) pe++;
        do {
            pe--;
        } while ( (pe > p) && isspace(*pe) );
        if (p == s) {
            *++pe = '\0';
        } else {  //move
            while ( p <= pe ) *s++ = *p++;
            *s = '\0';
        }
    }

